Empezamos los ejercicios depair programming con Pandas. En esta lecci√≥n hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.

In [3]:
import pandas as pd
import numpy as np

Empezamos los ejercicios depair programming con Pandas. En esta lecci√≥n hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.

El objetivo de la clase de hoy ser√° crear unos cu√°ntos dataframes y series a trv√©s de los siguientes ejercicios:

- ¬øQu√© diferencia hay entre una Serie y un Dataframe?

In [4]:
#Serie: una dimensi√≥n, que contiene un array de datos. Tiene dos componentes principales que son los indices y vector.

#DataFrame: 2 dimensiones, se pueden guardar datos de distinto tipo (string, entero, float,..),la diferencia es que hay m√°s dimensiones y por lo tanto podemos tener mas columnas con valores.

Momento de trabajar con Series. Contestas las siguientes preguntas:

Crea dos listas:
- Una que se llame "valores" que tenga 7 n√∫meros aleatorios.
- Otra que se llame "indices" que tenga 7 strings que se llamen como los dias de la semana.

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los √≠ndices de la Serie.

In [5]:
valores = [11,12,13,14,15,16,17]

indices = ["lunes", "martes","miercoles","jueves","viernes","sabado","domingo",]

serie1 = pd.Series(valores, index = indices)

print(serie1)

lunes        11
martes       12
miercoles    13
jueves       14
viernes      15
sabado       16
domingo      17
dtype: int64

A partir de las dos listas anteriores crea un diccionario usando un for. Para hacer esto tenemos el m√©todo zip que nos permite iterar por dos listas a la vez. M√°s informci√≥n sobre este m√©todo aqu√≠.

In [20]:
valores = [11,12,13,14,15,16,17]
indices = ["lunes", "martes","miercoles","jueves","viernes","sabado","domingo"]

serie2 = {}

for uno,dos in zip(indices,valores): 
    serie2 [uno] = dos

#serie2 = dict((zip(valores,indices)))  # se puede hacer asi, pero con buclo FOR arriba.
print(serie2)

{'lunes': 11, 'martes': 12, 'miercoles': 13, 'jueves': 14, 'viernes': 15, 'sabado': 16, 'domingo': 17}

Crea una Serie con el diccionario creado en el punto anterior.
- ¬øQu√© forma tiene esta √∫ltima Serie?
- ¬øQu√© tipo de datos tiene?
- ¬øQu√© tama√±o tiene?
- ¬øCu√°les son los √≠ndices de la Serie?
- ¬øY los values?
- Extraed el valor para el √≠ndice "lunes"
- Extraed el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles"
- Extraed el valor para el √≠ndice "lunes" y "domingo"

In [25]:
serie2 

serie3 = pd.Series(serie2)
print(serie3)

def propiedades (serie3):
    print("index:", serie3.index) 
    print("values:",serie3.values) 
    print("Forma:", serie3.shape) 
    print("N¬™ elementos:", serie3.size) 
    print("Tipo de datos:", serie3.dtype) 

propiedades(serie3)

#--

print("El valor del lunes:", serie3.values[0]) 
print("El valor del lunes,martes y miercoles:",serie3.values[:3])
print("El valor de lunes a domingo:" ,serie3.values[[0,6]])

lunes        11
martes       12
miercoles    13
jueves       14
viernes      15
sabado       16
domingo      17
dtype: int64
index: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
values: [11 12 13 14 15 16 17]
Forma: (7,)
N¬™ elementos: 7
Tipo de datos: int64
El valor del lunes: 11
El valor del lunes,martes y miercoles: [11 12 13]
El valor de lunes a domingo: [11 17]

Es el turno de los dataframes
- Cread un array de dos dimensiones con 4 filas y 3 columnas.
- Convertid el array en un dataframe donde las columnas se llamen "Espa√±a", "Francia" e "Italia".

In [10]:
array = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
df = pd.DataFrame(array)

df = pd.DataFrame(array, columns = ["Espa√±a","Francia","Italia"])
df

   Espa√±a  Francia  Italia
0       1        2       3
1       4        5       6
2       7        8       9
3      10       11      12


Descargad el archivo "medallas" y cargad el dataframe con la siguiente l√≠ena de c√≥digo:
    df = pd.read_csv("medallas.csv", index_col=["Pa√≠s"])

üìå NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura que el jupyter donde estamos trabajando.

- Usando el loc extraed todas las columnas de la fila.
- Usando el loc extraed todas las columnas de China e Ir√°n.
- Usando el locextraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir√°n.
- Usando el iloc extraed la informaci√≥n de la India. Devolved todas las columnas
- Usando el ilocextraed todas las columnas de los paises que est√©n en posici√≥n impar. La primera que nos tendr√≠a que salir es Jap√≥n y la √∫ltima Corea del Norte.

In [71]:
ruta = "/Users/lidiacarriedoponce/Desktop/Modulo 2 -Numpy_Pandas_/18 Abril - Pandas I/medallas.csv"
df = pd.read_csv(ruta)


print(df.loc[:]) # me lo ense√±a todo

print(df.loc[0,:]) # me da la info de fila 0 y todas sus columnas

print(df.loc[[0,3],:]) #todas las columnas de China e Ir√°n 

print(df.iloc[5,:]) # Utilizando iloc

print(df.iloc[1:10:2, :]) # Todas las columnas impares desde Jap√≥n a Corea del norte

HOLA    Unnamed: 0             Pa√≠s   Oro  Plata  Bronce
1           2            Jap√≥n  1032   1037     985
3           4             Ir√°n   179    181     197
5           6            India   154    202     315
7           8        Indonesia   112    131     240
9          10  Corea del Norte    91    120     235

   Unnamed: 0             Pa√≠s   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Jap√≥n  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Ir√°n   179    181     197
4           5       Kazajist√°n   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taip√©i    99    144     276
9          10  Corea del Norte    91    120     235

Utilizando el c√≥digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

Contestad a las siguientes preguntas:
- ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
- ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro y m√°s de 1000 de plata?
- ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?
- Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.
- Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa√≠s.

In [43]:

print("Paises con m√°s de 200 medallas de oro")
df.loc[df.Oro > 200,:]

Paises con m√°s de 200 medallas de oro

   Unnamed: 0           Pa√≠s   Oro  Plata  Bronce
0           1          China  1473    994     720
1           2          Jap√≥n  1032   1037     985
2           3  Corea del Sur   745    663     827

In [44]:
print("Paises con m√°s de 200 medallas de oro y m√°s de 1000 de plata")
df.loc[(df.Oro > 200) & (df.Plata > 1000)]

Paises con m√°s de 200 medallas de oro y m√°s de 1000 de plata

   Unnamed: 0   Pa√≠s   Oro  Plata  Bronce
1           2  Jap√≥n  1032   1037     985

In [45]:
print("Paises con m√°s de 200 medallas de oro o 700 de bronce")
df.loc[(df.Oro > 200) | (df.Bronce > 700)]

Paises con m√°s de 200 medallas de oro o 700 de bronce

   Unnamed: 0           Pa√≠s   Oro  Plata  Bronce
0           1          China  1473    994     720
1           2          Jap√≥n  1032   1037     985
2           3  Corea del Sur   745    663     827

In [62]:
print("Eliminada columna Unnamed:0")
df = df.drop(["Unnamed: 0"], axis=1) # 0 es filas y 1 es columnas
df

Eliminada columna Unnamed:0

              Pa√≠s   Oro  Plata  Bronce
0            China  1473    994     720
1            Jap√≥n  1032   1037     985
2    Corea del Sur   745    663     827
3             Ir√°n   179    181     197
4       Kazajist√°n   155    158     224
5            India   154    202     315
6        Tailandia   132    175     278
7        Indonesia   112    131     240
8     China Taip√©i    99    144     276
9  Corea del Norte    91    120     235

In [64]:
print("Crear columna total resultado de la suma de todas las medallas")
df = df.assign(total_medallas = df["Oro"] + df["Plata"] + df["Bronce"])
df

Crear columna total resultado de la suma de todas las medallas

              Pa√≠s   Oro  Plata  Bronce  total_medallas
0            China  1473    994     720            3187
1            Jap√≥n  1032   1037     985            3054
2    Corea del Sur   745    663     827            2235
3             Ir√°n   179    181     197             557
4       Kazajist√°n   155    158     224             537
5            India   154    202     315             671
6        Tailandia   132    175     278             585
7        Indonesia   112    131     240             483
8     China Taip√©i    99    144     276             519
9  Corea del Norte    91    120     235             446